<template>
  <div class="terms">
    <h1>码道协议（草案）</h1>
    <p>欢迎您来到本站。</p>
    <p>请您仔细阅读以下条款，如果您对本协议的任何条款表示异议，您可以选择不继续进行。当您注册成功，在本站任何操作均意味着您（即「用户」）完全接受本协议项下的全部条款。</p>
    <h2><a id="sec-report" href="">侵权举报</a></h2>
    <ol>
      <li>
        <p>处理原则</p>
        <p>码道作为技术论坛社区，高度重视自由表达和个人、企业正当权利的平衡。依照法律规定删除违法信息是码道社区的法定义务，码道社区亦未与任何中介机构合作开展此项业务。</p>
      </li>
      <li>
        <p>受理范围</p>
        <p>受理码道社区内侵犯企业或个人合法权益的侵权举报，包括但不限于涉及个人隐私、造谣与诽谤、商业侵权。</p>
        <ol>
          <li>涉及个人隐私：发布内容中直接涉及身份信息，如个人姓名、家庭住址、身份证号码、工作单位、私人电话等详细个人隐私；</li>
          <li>造谣、诽谤：发布内容中指名道姓（包括自然人和企业）的直接谩骂、侮辱、虚构中伤、恶意诽谤等；</li>
          <li>商业侵权：泄露企业商业机密及其他根据保密协议不能公开讨论的内容。</li>
        </ol>
      </li>
      <li>
        <p>举报条件</p>
        <p>用户在码道发表的内容仅表明其个人的立场和观点，并不代表码道的立场或观点。如果个人或企业发现码道上存在侵犯自身合法权益的内容，可以先尝试与作者取得联系，通过沟通协商解决问题。如您无法联系到作者，或无法通过与作者沟通解决问题，您可通过点击内容下方的举报按钮来向码道平台进行投诉。为了保证问题能够及时有效地处理，请务必提交真实有效、完整清晰的材料，否则投诉将无法受理。您需要向码道提供的投诉材料包括：</p>
        <ol>
          <li>权利人对涉嫌侵权内容拥有商标权、著作权和/或其他依法可以行使权利的权属证明，权属证明通常是营业执照或组织机构代码证；</li>
          <li>举报人的身份证明，身份证明可以是身份证或护照；</li>
          <li>如果举报人非权利人，请举报人提供代表权利人进行举报的书面授权证明。</li>
          <li>为确保投诉材料的真实性，在侵权举报中，您还需要签署以下法律声明：<br>
            • 我本人为所举报内容的合法权利人；<br>
            • 我举报的发布在码道社区中的内容侵犯了本人相应的合法权益；<br>
            • 如果本侵权举报内容不完全属实，本人将承担由此产生的一切法律责任，并承担和赔偿码道因根据投诉人的通知书对相关帐号的处理而造成的任何损失，包括但不限于码道因向被投诉方赔偿而产生的损失及码道名誉、商誉损害等。</li>
        </ol>
      </li>
      <li>
        <p>处理流程</p>
        <p>出于网络平台的监督属性，并非所有申请都必须受理。码道自收到举报的七个工作日内处理完毕并给出回复。处理期间，不提供任何电话、邮件及其他方式的查询服务。</p>
        <p>出现码道已经删除或处理的内容，但是百度、谷歌等搜索引擎依然可以搜索到的现象，是因为百度、谷歌等搜索引擎自带缓存，此类问题码道无权也无法处理，因此相关申请不予受理。您可以自行联系搜索引擎服务商进行处理。</p>
        <p>此为码道社区唯一的官方侵权投诉渠道，暂不提供其他方式处理此业务。</p>
        <p>用户在码道中的商业行为引发的法律纠纷，由交易双方自行处理，与码道无关。</p>
      </li>
    </ol>
    <h2><a id="sec-impunity" href="">免责声明</a></h2>
    <ol>
      <li>码道不能对用户发表的回答或评论的正确性进行保证。</li>
      <li>用户在码道发表的内容仅表明其个人的立场和观点，并不代表码道的立场或观点。作为内容的发表者，需自行对所发表内容负责，因所发表内容引发的一切纠纷，由该内容的发表者承担全部法律及连带责任。码道不承担任何法律及连带责任。</li>
      <li>码道不保证网络服务一定能满足用户的要求，也不保证网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作保证。</li>
      <li>对于因不可抗力或码道不能控制的原因造成的网络服务中断或其它缺陷，码道不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。</li>
    </ol>
    <h2><a id="sec-modification" href="">协议修改</a></h2>
    <ol>
      <li>根据互联网的发展和有关法律、法规及规范性文件的变化，或者因业务发展需要，码道有权对本协议的条款作出修改或变更，一旦本协议的内容发生变动，码道将会直接在码道网站上公布修改之后的协议内容，该公布行为视为码道已经通知用户修改内容。码道也可采用电子邮件或私信的传送方式，提示用户协议条款的修改、服务变更、或其它重要事项。</li>
      <li>如果不同意码道对本协议相关条款所做的修改，用户有权并应当停止使用码道。如果用户继续使用码道，则视为用户接受码道对本协议相关条款所做的修改。</li>
    </ol>
  </div>
</template>

<script>
export default {
  name: 'Terms'
}
</script>

<style scoped>
  .terms {
    box-sizing: border-box;
    margin: 0;
    min-width: 0;
    margin: auto;
    max-width: 740px;
  }
</style>
